In [1]:
import pandas as pd 
import numpy as np

In [4]:
misResultados = pd.DataFrame({
    "Matematica": [100, 70],
    "Programacion": [180, 60],
    "Hacking": [90, 80]
},
    index=["Bloque 1", "Bloque 2"])
misResultados

          Matematica  Programacion  Hacking
Bloque 1         100           180       90
Bloque 2          70            60       80

In [3]:
misResultados.describe()

       Matematica  Programacion    Hacking
count    2.000000      2.000000   2.000000
mean    85.000000    120.000000  85.000000
std     21.213203     84.852814   7.071068
min     70.000000     60.000000  80.000000
25%     77.500000     90.000000  82.500000
50%     85.000000    120.000000  85.000000
75%     92.500000    150.000000  87.500000
max    100.000000    180.000000  90.000000

In [8]:
fruits = pd.DataFrame({
    "Apples": [30, 41],
    "Bananas": [21, 34]
}, 
    index=["2017 Sales", "2018 Sales"])

fruits

            Apples  Bananas
2017 Sales      30       21
2018 Sales      41       34

In [9]:
# Ingredientes 
ingredients = {
    "Flour": "4 cups",
    "Milk": "1 cup",
    "Eggs": "2 large",
    "Spam": "1 can" 
}
ingredients = pd.Series(ingredients)
ingredients

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
dtype: object